In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
val1=np.array([1,2,None,4])
val1

array([1, 2, None, 4], dtype=object)

In [4]:
val1.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [5]:
val2=np.array([1,2,np.NaN,4])
val2

array([ 1.,  2., nan,  4.])

In [8]:
val2.dtype

dtype('float64')

In [9]:
val2.sum()

nan

In [11]:
np.nansum(val2)

7.0

In [12]:
pd.Series([1,2,None,np.nan,5])

0    1.0
1    2.0
2    NaN
3    NaN
4    5.0
dtype: float64

In [13]:
a=pd.Series([1,2,3])

In [14]:
a

0    1
1    2
2    3
dtype: int64

In [15]:
a[0]=None

In [16]:
a

0    NaN
1    2.0
2    3.0
dtype: float64

In [17]:
a.isnull()

0     True
1    False
2    False
dtype: bool

In [18]:
a.notnull()

0    False
1     True
2     True
dtype: bool

In [19]:
a.dropna()

1    2.0
2    3.0
dtype: float64

In [21]:
a.fillna(0)

0    0.0
1    2.0
2    3.0
dtype: float64

In [26]:
a=np.random.normal(size=(3,4))
a[1,3]=np.nan
a[2,1]=None

In [27]:
data=pd.DataFrame(a)
data

          0         1         2         3
0 -0.845372  1.205134 -0.120943  0.270392
1  0.084495  0.172543  0.216613       NaN
2  0.709883       NaN  0.093236  1.156556

In [30]:
d=round(data,ndigits=2)

In [31]:
d

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22   NaN
2  0.71   NaN  0.09  1.16

In [32]:
d.dropna()

      0     1     2     3
0 -0.85  1.21 -0.12  0.27

In [33]:
d.dropna(axis=1)

      0     2
0 -0.85 -0.12
1  0.08  0.22
2  0.71  0.09

In [36]:
d.dropna(axis=1,how='all')

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22   NaN
2  0.71   NaN  0.09  1.16

In [37]:
d.dropna(axis=1,how='any')

      0     2
0 -0.85 -0.12
1  0.08  0.22
2  0.71  0.09

In [35]:
pd.DataFrame.dropna?

In [38]:
d.dropna(axis=1,thresh=1)

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22   NaN
2  0.71   NaN  0.09  1.16

In [39]:
d.dropna(axis=1,thresh=0)

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22   NaN
2  0.71   NaN  0.09  1.16

In [40]:
d.dropna(axis=1,thresh=2)

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22   NaN
2  0.71   NaN  0.09  1.16

In [41]:
d.dropna(axis=1,thresh=3)

      0     2
0 -0.85 -0.12
1  0.08  0.22
2  0.71  0.09

In [42]:
d.fillna(0)

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22  0.00
2  0.71  0.00  0.09  1.16

In [43]:
d.fillna(method='ffill')

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22  0.27
2  0.71  0.17  0.09  1.16

In [44]:
d.fillna(method='bfill')

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22  1.16
2  0.71   NaN  0.09  1.16

In [45]:
d.fillna(method='bfill',axis=1)

      0     1     2     3
0 -0.85  1.21 -0.12  0.27
1  0.08  0.17  0.22   NaN
2  0.71  0.09  0.09  1.16